{
    "style": "Auditory",
    "description": "<p>Guess what? It looks like you are an auditory learner - which means that you learn best through listening. Read on to explore exactly what that means and how it can help you in your school work.</p><p>People who are auditory learners usually prefer to get information by listening.</p><p>They need to hear it to know it and remember what was discussed rather than what was seen.</p><p>Although they have trouble with reading and writing, they enjoy reading aloud and spell better out loud than in writing.</p><p>Also, they are talkative and love discussions.</p><p>In the classroom, auditory learners learn best through verbal lessons and may have difficulty following written directions.</p><p>They benefit from participating in class discussions, talking things through and listening to what other people say.</p><p>They tend to have trouble reading the teachers body language and facial expressions.</p><p>When possible, auditory learners can really benefit from taping their classroom lectures and playing them back at home.</p><p>Auditory learners can benefit from study groups or with a &quot;study buddy&quot; to help them review for a test.</p><p>When studying by themselves, auditory learners should try to read their textbooks or notes aloud to help them recall information.</p><p>Books on tape are also very helpful as well as discussing class topics with other students.</p><p>There are ways to help increase your auditory learning styles such as playing games like Scrabble; listening to stand-up comedians; doing crossword puzzles; memorizing your favorite poem or passage.</p>",
    "careers": [
        "Comedians",
        "Curators",
        "Editors",
        "Librarians",
        "Journalists",
        "Lawyers",
        "Secretaries",
        "Speech Pathologists",
        "Therapists",
        "Writers"
    ],
    "famous": [
        "Emily Dickinson",
        "Stevie Wonder",
        "J.K. Rowling",
        "Beethoven",
        "Jon Bon Jovi",
        "Lisa Kudrow"
    ]
}
