{
    "style": "Visual",
    "description": "<p>Fantastic! It looks like you are a visual learner which means that you learn best through seeing things. Now, let's explore exactly what that means and how it can help you in your school work.</p><p>Visual learners think in pictures, have a strong sense of color and remember what they have seen rather than what they have heard.</p><p>They need to create clear images in their minds so that they can remember information.</p><p>In other words, they need to see it to learn it.</p><p>Also, they may have trouble with spoken directions, over react to sound, and misinterpret words.</p><p>In the classroom, visual learners benefit from teachers who write on the board, use flip charts, diagrams, videos, maps, charts and overhead projectors.</p><p>It is helpful to them if they sit close to the front of the classroom so that they have fewer distractions.</p><p>Also, it is important for them to be able to see their teacher's facial expressions and body language in order to fully understand the content of the lesson.</p><p>Reading textbooks is preferred by visual learners because they would rather read than be read to.</p><p>Recalling the pictures in a textbook can be very helpful when trying to answer questions on a test.</p><p>They should take notes on things that they have learned while reading and  add pictures or symbols to their notes to help them remember things. Also, use diagrams and charts when appropriate.</p><p>Studying alone helps visual learners instead of being in a study group.</p><p> Using highlighters to color code notes and using flashcards are helpful study tips.</p><p>Also, there are ways to help increase your visual learning styles such as doing jigsaw puzzles or playing games like Pictionary.</p>",
    "careers": [
        "Visual Artists (sculptors or painters)",
        "Inventors",
        "Architects",
        "Interior Designers",
        "Mechanics/Engineers",
        "Graphic Artists",
        "Photographers",
        "Web Designers",
        "Pilots",
        "Movie Directors"
    ],
    "famous": [
        "Amelia Earhart",
        "Stephen Spielberg",
        "Anne Geddes",
        "Betsy Johnson",
        "Picasso",
        "Penny Marshall"
    ]
}
