{
    "type": "ENFJ",
    "long_name": "Extraverted iNtuitive Feeling Judging",
    "description": "<p>ENFJs are friendly teachers in the world, whether they are professional teachers or not. They have a lot of energy when it comes to guiding others and getting others to do things. They make good leaders because they have excellent communication skills. Being skilled at getting others to believe in the things the individual ENFJ believes in can make the ENFJ a great leader or a selfish manipulator of others. But most ENFJs believe in their dreams and plans and want to help others follow those dreams and plans to a better life. ENFJs like to help people.</p><p>ENFJs like to learn and want to understand the big picture, not just parts here and there. They like to do many things at once, having several projects going at one time. Because of their leadership and interest in the big picture, ENFJs often choose to be business owners and are successful at that.</p><p>ENFJs are generally organized and like to make decisions based on their feelings about the person or the situation at hand. They know and appreciate people, which can be very beneficial as they tend to be liked by others. But ENFJs can oftentimes have their feelings hurt in their attempts to please others. They tend to neglect themselves while trying to meet the needs of others. They should also not try to take on too many responsibilities at one time so they can feel satisfaction in completing fewer things well instead of spreading their time, energy and resources too thin.</p><p>ENFJs tend to be very outgoing and to have many friends. Their relationships are personable and warm. It can be difficult to build deep relationships with a lot of people, so some ENFJs find that while they have many fun friends to hang out with, their relationships do not often go much deeper.</p><p>ENFJs tend to be optimistic and look for the silver lining in a tough situation. They use their great sense of intuition and feeling to avoid potential obstacles in a situation and to find the best solution for their friends, family and work environments. ENFJs like to know as many details as possible so they can make the best decision possible.</p>",
    "careers": [
        "Facilitator",
        "Consultant",
        "Psychologist",
        "Social Worker / Counselor",
        "Teacher"
    ]
}
