{
    "type": "ENFP",
    "long_name": "Extraverted iNtuitive Feeling Perceiving",
    "description": "<p>General: ENFPs are both &quot;idea&quot;-people and &quot;people&quot;-people, who see everyone and everything as connected. They sincerely want to help others and at the same time desire to be liked and admired by other people. They are interested in new exploring new ideas, although many times they think their idea is the best.</p><p>Social/Personal Relationships: ENFPs are very charming. They are outgoing, fun, and genuinely like people, however, they tend to get bored easily and many times they seek new relationships and can forget about old friends for long periods of time. Less mature ENFPs may need to feel they are the center of attention all the time, to reassure them that everyone thinks they're a wonderful and fascinating person.</p><p>ENFPs often have strong convictions on various issues related to the way they see the world. They usually try to use their social skills and contacts to persuade people that their point of view is correct.</p><p>Work Environment: ENFPs are pleasant, easygoing, and usually fun to work with. They come up with great ideas, and are a major asset in brainstorming sessions. They can improve when it comes to follow through because they can get bored quickly. They also tend to be procrastinators, both about meeting hard deadlines and about performing any small, uninteresting tasks that they've been assigned. ENFPs are at their most useful when working in a group and can help finish a project.</p><p>ENFPs dislike bureaucracy, sometimes referred to as &quot;red tape.&quot; They like things to run smoothly and efficiently and get bored with having to go through a process they see as unnecessary.</p><p>ENFPs are friendly folks. Most are really enjoyable people. Some of the most soft-hearted people are ENFPs.</p>",
    "careers": [
        "Consultant",
        "Psychologist",
        "Entrepreneur",
        "Actor",
        "Teacher",
        "Counselor",
        "Politician / Diplomat",
        "Writer / Journalist",
        "Television Reporter"
    ]
}
