{
    "type": "ISFJ",
    "long_name": "Introverted Sensing Feeling Judging",
    "description": "<p>ISFJs have a sincere desire to serve others and they also have a &quot;need to be needed.&quot; They typically prefer to help people one-on-one or in their local community where they can see the local impact. In extreme cases, ISFJs can often feel &quot;cheated&quot; in relationships because they also apply this same standard of giving and serving others to their friends and loved ones, meaning they are often hurt when others don’t respond with the same level of enthusiasm to give back to the relationship.</p><p>ISFJs are often feel unappreciated at work, home, and play. They like to be recognized as someone who can &quot;get the job done.&quot; Ironically, because they prove over and over that they can be relied on for their loyalty and reliability, those around them often take them for granted--even take advantage of them. Others may not explicitly ask them to complete a task simply because they assume it will gone done by the ISFJ. Sometimes the ISFJ is hurt by this.</p><p>In the workplace, ISFJs are competent and precise workers, often with very good memories and unexpected analytic abilities. They are also good with people in small-group or one-on-one situations because of their patient and genuinely sympathetic approach to dealing with others. ISFJs make pleasant and reliable co-workers and exemplary employees, but tend to be uncomfortable as supervisors. They are very loyal to those around them, but these are personal rather than institutional loyalties, meaning the ISFJ is often doing a task to make his boss happy, but not necessarily because he feels it’s good for the company. Traditional careers for an ISFJ include: teaching, social work, most religious work, nursing, medicine (general practice only), clerical and and secretarial work of any kind, and some kinds of administrative careers.</p><p>While their work ethic is high on the ISFJ priority list, their families are the centers of their lives. ISFJs are extremely warm and show lots of affection within the family circle--and are often possessive of their loved ones, as well. They usually go to great expense to prepare nice meals and buy nice gifts for their loved ones. They can also get easily embarrassed with loved ones do something out of the ordinary because they like to fit in and not call attention to themselves as being different.</p><p>ISFJs have a few, close friends. They are extremely loyal to these, and are ready to provide emotional and practical support at a moment's notice. However, they don’t like confrontation so they will avoid an argument with someone even in defense of the loved one.</p>",
    "careers": [
        "Interior Decorators",
        "Designers",
        "Nurses",
        "Administrators and Managers",
        "Administrative Assistants",
        "Child Care / Early Childhood Development",
        "Social Work / Counselors",
        "Paralegals",
        "Clergy / Religious Workers",
        "Office Managers",
        "Shopkeepers",
        "Bookkeepers",
        "Home Economics"
    ]
}
